tap "homebrew/bundle"
brew "asdf"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "just"
brew "mas"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tree"
brew "zsh"
cask "font-monaspace-nerd-font"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
cask "brave-browser"
mas "com.apple.dt.Xcode", id: 497799835

vscode "mhutchie.git-graph"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "eamodio.gitlens"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "GitHub.vscode-pull-request-github"
vscode "GitHub.vscode-github-actions"
vscode "naumovs.color-highlight"
vscode "PKief.material-icon-theme"