brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "just"
brew "mas"
brew "mise"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tree"
brew "zsh"
cask "brave-browser"
cask "font-hack-nerd-font"
cask "font-monaspace-nerd-font"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mhutchie.git-graph"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
